#### :building_construction: Terraform Plan
  <details>

  <summary>dev - 0 to add, 3 to change, 0 to destroy</summary>

  ```
  Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.supernode[0].netbox_available_prefix.primary_ipv4 will be updated in-place
  ~ resource "netbox_available_prefix" "primary_ipv4" {
        id               = "331"
      ~ site_id          = 0 -> 12
        tags             = []
        # (15 unchanged attributes hidden)
    }

  # module.supernode[0].netbox_virtual_machine.supernode will be updated in-place
  ~ resource "netbox_virtual_machine" "supernode" {
        id                 = "64"
        name               = "supernode-dev-0"
      - site_id            = 12 -> null
        tags               = []
        # (16 unchanged attributes hidden)
    }

  # module.supernode[0].proxmox_vm_qemu.supernode will be updated in-place
  ~ resource "proxmox_vm_qemu" "supernode" {
      + default_ipv4_address   = (known after apply)
        id                     = "pm4/qemu/104"
        name                   = "supernode-dev-0"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      ~ sshkeys                = <<-EOT
            ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIN9C1hWDBL9driOUQhemBqYUFA1I7VM1UYt5ZDnIynZa
          - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJHQFe5F5okyt3Oo70cSeZTyUs9c6DFEw3a3jSmtpg+B
          - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDtrlD92PUcw1SmnmTIy2/YpfVFlm5b6Crnd0rM6bdzc marcus@Marcuss-MacBook-Pro-2.local
          + ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIENGZph/RX7JwmGIT9bWi+kgUV3XnmVtMma8RuIvv57u
          + ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDtrlD92PUcw1SmnmTIy2/YpfVFlm5b6Crnd0rM6bdzc
          + ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAsGlElGJxP1/Mr1AhoZsWQn7N8+cZNA3lMd8HPDHRQj
        EOT
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (59 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
  ```

  </details>